export const retrievedDocsQ4 = [
  {
    title: "060. 조립기.docx",
    text: `1) 전체 레이아웃 화면
    조립기 레이아웃 상의 기기별 수동 조작화면으로 이동할 수 이는 화면입니다.
    화면 이동 방법 : 하단 메뉴의 ‘수동운전’
    파레트 대기 영역 : 해당 영역을 터치하면 파레트 대기 위치의 기기를 수동 조작할 수 있는 화면으로 이동합니다.
    X,Y 테이블 영역: 해당 영역을 터치하면 X,Y 테이블의 기기를 수동 조작할 수 있는 화면으로 이동합니다.
    로봇 영역 : 해당 영역을 터치하면 로봇을 수동 조작할 수 있는 화면으로 이동합니다.
    우측 메뉴 버튼 : ‘파레트 대기’, ‘X,Y 테이블’, ‘로봇’ 화면으로 이동할 수 있는 버튼입니다. 
    원하는 화면 이름을 확인하시고, 해당 버튼을 누르면 화면이 전환됩니다.
    2) 파레트 대기화면
    파레트가 대기하는 위치와 조립 테이블의 실린더를 수동으로 조작할 수 있는 화면입니다.
    화면 이동 방법 : 하단 메뉴의 ‘수동운전’ → 우측 메뉴의 ‘파레트 대기’ 또는
    하단 메뉴의 ‘수동운전’ → 레이아웃상의 파레트 대기영역 터치
    ST01 정렬실린더 : ST01에 파레트 대기위치의 정렬실린더를 수동 조작합니다. ‘후진’ 버튼을 누르면 실린더가 후진하고, ‘전진’ 버튼을 누르면 실린더가 전진합니다.
    M6120: 후진 S/W 어드레스, M6140: 후진 확인 LAMP 어드레스
    M6121: 전진 S/W 어드레스, M6141: 전진 확인 LAMP 어드레스
    ST03 정렬실린더 : ST03에 X,Y테이블의 정렬실린더를 수동 조작합니다. ‘후진’ 버튼을 누르면 실린더가 후진하고, ‘전진’ 버튼을 누르면 실린더가 전진합니다.
    M6122: 후진 S/W 어드레스, M6142: 후진 확인 LAMP 어드레스
    M6123: 전진 S/W 어드레스, M6143: 전진 확인 LAMP 어드레스 .....
    `,
  },
  {
    title: "012. AGV CONV#1.docx",
    text: `수동운전 화면은 전체 레이아웃, ST01, ST02, AGV, 메모리클리어 화면으로 구성되어 있습니다.
    전체 레이아웃 화면
    설비의 전체화면에서 기기별 수동조작을 하기 위해 해당 기기를 터치하면 화면 전환이
    가능합니다.
    화면 이동 방법 : 하단 메뉴의 ‘수동운전’
    ST01 수동 운전
    터치 화면의 적색 사각형을 누르면 AGV의 컨베이어를 수동으로 조작할 수 있는 화면으로 전환됩니다.
    AGV 수동 운전
    터치 화면의 적색 사각형을 누르면 AGV를 수동으로 이동할 수 있는 화면으로 전환됩니다.
    우측 메뉴 버튼
    ‘전체 레이아웃’, ‘ST01’, ‘ST02’, ‘AGV’, ‘메모리클리어’ 화면으로 이동하는 버튼이 표시되어 있습니다. 터치시 해당 화면으로 전환됩니다.
    ST01 : ST01에 롤러, 기기를 수동 조작하는 화면으로 이동하는 버튼
    ST02 : ST02에 롤러, 기기를 수동 조작하는 화면으로 이동하는 버튼
    AGV : AGV를 수동으로 이동조작 가능한 화면으로 ......
    `,
  },
  {
    title: "011. AGV KIT.docx",
    text: `수동운전 화면은 전체 레이아웃, AGV, AGV진공, AGV ROBOT 화면으로 구성되어 있습니다.
    전체 레이아웃 화면
    화면 이동 방법  : 하단 메뉴의 ‘수동운전’
    설비의 전체화면에서 기기별 수동조작을 하기 위해 해당 기기를 터치하면 화면 전환이 가능합니다.
    로봇 진공 SOL 수동 운전
    터치 화면의 적색 사각형을 누르면 로봇 진공 SOL을 수동 조작할 수 있는
    화면으로 변경됩니다.
    AGV 수동 운전
    터치 화면의 적색 사각형을 누르면 AGV를 수동으로 이동할 수 있는 화면으로
    변경됩니다.
    우측 메뉴 버튼
    기기별 수동 운전화면으로 이동하는 버튼입니다......
    `,
  },
  {
    title: "014. AGV CONV#2.docx",
    text: `수동운전 화면은 전체 레이아웃, ST03, ST04, AGV, 메모리클리어 화면으로 구성되어 있습니다.
    전체 레이아웃 화면
    설비의 전체화면에서 기기별 수동조작을 하기 위해 해당 기기를 터치하면 화면 전환이
    가능합니다.
    화면 이동 방법 : 하단 메뉴의 ‘수동운전’
    ST03 수동 운전
    터치 화면의 적색 사각형을 누르면 AGV의 컨베이어를 수동으로 조작할 수 있는 화면으로 전환됩니다.
    AGV 수동 운전
    터치 화면의 적색 사각형을 누르면 AGV를 수동으로 이동할 수 있는 화면으로 전환됩니다.
    우측 메뉴 버튼
    ‘전체 레이아웃’, ‘ST03’, ‘ST04’, ‘AGV’, ‘메모리클리어’ 화면으로 이동하는 버튼이 표시되어 있습니다. 터치시 해당 화면으로 전환됩니다.
    ST03 : ST03에 롤러, 기기를 수동 조작하는 화면으로 이동하는 버튼
    ST04 : ST04에 롤러, 기기를 수동 조작하는 화면으로 이동하는 버튼
    AGV : AGV를 수동으로 이동조작 가능한 화면으로 이동하는 버튼 .....
    `,
  },
  {
    title: "013. AGV SHIP.docx",
    text: `수동운전 화면은 전체 레이아웃, AGV, 로봇 화면으로 구성되어 있습니다.
    설비의 전체화면에서 기기별 수동조작을 하기 위해 해당 기기를 터치하면 화면 전환이
    가능합니다.
    화면 이동 방법 : 하단 메뉴의 ‘수동운전’
    AGV 수동 운전
    터치 화면의 적색 사각형을 누르면 AGV를 수동으로 이동할 수 있는 화면으로 전환됩니다
    우측 메뉴 버튼
    ‘전체 레이아웃’, ‘AGV’, ‘로봇’ 화면으로 이동하는 버튼이 표시되어 있습니다. 터치시 해당 화면으로 전환됩니다.
    AGV : AGV를 수동으로 이동조작 가능한 화면으로 이동하는 버튼
    로봇 : AGV 위의 로봇 전동그리퍼를 수동 조작 가능한 화면으로 이동하는 버튼
    AGV 수동 운전
    화면 이동 방법 : 하단 메뉴의 ‘수동운전’ → 우측 메뉴의 ‘AGV’ 또는
    하단 메뉴의 ‘수동운전’ → 레이아웃 화면의 AGV 사각영역
    작동 순서 : 수동위치 숫자 터치 → 이동 위치 기입 → ‘수동이동’ 버튼 터치 →
    ‘처리중’ 색상 변경 확인 → AGV 이동(‘이동중’ 색상 변경 확인) → AGV 도착 확인
    (‘이동완료’ 색상 변경 확인) → AGV 위치 확인
    상태 표시 : AGV의 상태를 표시합니다.....
    `,
  },
];

export const retrievedDocsQ5 = [
  {
    title: "030. 레이저.docx",
    text: `안전도어 화면 설명.
    안전도어 화면
    안전문을 잠그거나 열 때 조작하는 화면입니다.
    화면 이동 방법 : 하단 메뉴의 ‘운전정보’ → 우측 메뉴의 ‘안전도어’
    LOCK : 안전문 잠금 버튼, 안전문이 닫힘 상태에서 LOCK 버튼을 누르면, 안전문 고리가
    열리지 않습니다. 안전문이 잠긴 상태이면 버튼 색상이 녹색으로 변경됩니다.
    UNLOCK : 안전문 풀림 버튼, 수동 운전모드에서만 적용되며, UNLOCK 버튼을 누르면
    안전문 고리를 열 수 있습니다. 안전문이 열린 상태이면 버튼 색상이 노란색으로
    변경됩니다.
    ∴ 로봇 이상시 반드시 수동 운전모드로 전환하고 확인하시비 바랍니다.
    ∴ 수동 운전모드 : OP의 모드 셀렉트 스위치가 ‘MANU’로 되어있는 상태
    안전문 잠김/열림상태 표시
    <안전문 잠김상태>  <안전문 열린상태> .....
    `,
  },
  {
    title: "020. KIT ZONE.docx",
    text: `MODEL ‘CASE C’ : CASE C 모델에 대한 검사를 표시
    OK : 검사 결과가 OK임을 표시, 녹색 램프로 변경
    NG : 검사 결과가 NG임을 표시, 적색 램프로 변경
    수동 조작 : 비전 검사결과에 따라 수동으로 조작하는 버튼입니다.
    재시도 : 비전 검사를 다시 실행하는 버튼, 누르면 버튼이 노란색으로 변경됩니다.
    강제 OK : 비전 검사 결과가 NG지만, 양품으로 전환시키는 버튼,
    누르면 버튼이 노란색으로 변경됩니다.
    안전도어
    안전문을 잠그거나 열 때 조작하는 화면입니다.
    화면 이동 방법 : 하단 메뉴의 ‘운전정보’ → 우측 메뉴의 ‘안전도어’
    LOCK : 안전문 잠금 버튼, 안전문이 닫힘 상태에서 LOCK 버튼을 누르면, 안전문 고리가
    열리지 않습니다. 안전문이 잠긴 상태이면 버튼 색상이 녹색으로 변경됩니다.
    UNLOCK : 안전문 풀림 버튼, 수동 운전모드에서만 적용되며, UNLOCK 버튼을 누르면
    안전문 고리를 열 수 있습니다. 안전문이 열린 상태이면 버튼 색상이 노란색으로
    변경됩니다.....
    `,
  },
  {
    title: "040. NC.docx",
    text: `열리지 않습니다. 안전문이 잠긴 상태이면 버튼 색상이 녹색으로 변경됩니다.
    UNLOCK : 안전문 풀림 버튼, 수동 운전모드에서만 적용되며, UNLOCK 버튼을 누르면
    안전문 고리를 열 수 있습니다. 안전문이 열린 상태이면 버튼 색상이 노란색으로
    변경됩니다.
    ∴ 로봇 이상시 반드시 수동 운전모드로 전환하고 확인하시비 바랍니다.
    ∴ 수동 운전모드 : OP의 모드 셀렉트 스위치가 ‘MANU’로 되어있는 상태
    안전문 잠김/열림상태 표시
    <안전문 잠김상태>  <안전문 열린상태> .....
    `,
  },
  {
    title: "040. NC (수동운전 화면).docx",
    text: `전체 레이아웃
    NC 가공기의 ST별 기기 수동조작 화면과 3축 직교로봇의 수동 조작 화면으로 이동할 수 
    있는 화면입니다.
    화면 이동 방법 : 하단 메뉴의 ‘수동운전’
    키트 컨베이어 : 사각 영역을 터치하면 키트 컨베이어의 ST별로 기기를 수동 조작할 수 
    있는 화면으로 이동합니다.
    직교 로봇 : 사각 영역을 터치하면 직교 로봇 3축과 로더를 수동 조작할 수 있는 화면으로
    이동합니다.
    우측 메뉴 버튼 : ‘키트 컨베이어’와 ‘직교 로봇’을 수동 조작할 수 있는 화면으로 
    이동합니다. 원하는 화면 이름을 확인하시고 해당 버튼을 누르시면 화면이 전환됩니다.
    키트 컨베이어
    ST01 화면
    ST01의 기기들을 수동으로 조작할 수 있는 화면입니다.....
    `,
  },
  {
    title: "012. AGV CONV#1.docx",
    text: `수동운전 화면은 전체 레이아웃, ST01, ST02, AGV, 메모리클리어 화면으로 구성되어 있습니다.
    전체 레이아웃 화면
    설비의 전체화면에서 기기별 수동조작을 하기 위해 해당 기기를 터치하면 화면 전환이
    가능합니다.
    화면 이동 방법 : 하단 메뉴의 ‘수동운전’
    ST01 수동 운전
    터치 화면의 적색 사각형을 누르면 AGV의 컨베이어를 수동으로 조작할 수 있는 화면으로 전환됩니다.
    AGV 수동 운전
    터치 화면의 적색 사각형을 누르면 AGV를 수동으로 이동할 수 있는 화면으로 전환됩니다.
    우측 메뉴 버튼
    ‘전체 레이아웃’, ‘ST01’, ‘ST02’, ‘AGV’, ‘메모리클리어’ 화면으로 이동하는 버튼이 표시되어 있습니다. 터치시 해당 화면으로 전환됩니다......
    `,
  },
];
